node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2141536
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\274\346\260\275\n\227\244\275\276\037!\275\321i\272\274\315\251p\275\030\260S\276\273\203#\2767\353[\275@\225+\276\355\333v=cTR>-\200~<\277r1>!\347\321=i\376Q\275\270\263k>#\031\253<V\211Y\274\244#\2559\255\245\243=\374X\262\275p\366\211=\350\275\250=2\025\311\275\333p\216=\375\375y<P%\232\275\311\224`\274\005\321\036\276\223\302+>>~&>\251\264\357\274v\207\004=\2657<\276\373\201Y\276 \351\247\275\273\307\230\275o\037\242=\343Yx=\210\366\035>\201t\r>\031\005)=\036\372\217\275\017nI>\336(L\276\352wp\275l=V=O\217\217>\014\003 >?\365\204\275\353\351\364=D\357^\276\313\253\035\276n\211Z>\237^\270\275$\302]>I\251\035<\272\222\206\275\024\272z\276\353K\016>\004\244\364\275W5\\\276\267-v>\010\253{;\246cG\276\003\020?\275\222\263\324\275`\271\203=\236r\201>\321\362\014=\261\233\320\275\206a\232=6\310\372=\242|\023\274#t\245\275C\030A\275\234?>=\335\326v\276\302\342\003\276\0224\366\274\274r\321=\340\243>=\312.\022:\000\324s;\"\213\232=\313\230\232;\325:s\275\277\377\374\273\013D\334\275\374\352X\2752\024\202<x\322\241\275\341Vr\276\266_Y>:\326d=\345\222\016\276\022\310\242\275\227\210\003\275\252\314\n\2751\225&\275\2316\010\276T\020#<9{/>\365\371h>\375\234K\275D\373\341\274\030\006\205=\330\302f=\324`\247\276\314e\311=\262x_\275\301\226S\276\024Ks>\002\326?=A\017z;i\363\260\275K>\216>\314F\004>\254\203!\276\254K\324=]\273\001\275G\017\264\274\tn\"=\226\352H\275,\017==-\240+>\0242\033\276\014\355x\275\223\215%>at\220<SS6\276\235AX>\262\363\034>\0075&\276n\352@\276N\367\376=\242\264Z\275\260\256O>\263\272}>\270\034S\275\207\221\204<\030(\376=N\330G<\234\205\266\276\374Y\241;\255\013\300=\316\3017>\354\200\240\275o\025J<eF\254>+\177\003\276\034\224\034>\312?I\276\036\203\331<[\026\326=D/B>\226\227\257\275x\020\216=\300\232\225<\330\351;\274m*\314=\267\237\335\275D\005\200=inR<\361\377/>\230\275:\275!\235L\276\261\302\374<G)\276=H\202\177=\312\027\002\275\216\037\354\275\372\013\247\274h\274\222\275\245\266\023>\270\202\r>\245h\033\275%\352\322=\251\270\315<\227g\334<\257\001\242=\032\222c=\033 +\276*\251\021\275\276\024\347\275\330\300j\273\236GW\276I[\363<\214\2342\275%s\267\273G\242\252=1\364\034>+q\270=/d$>\355x\n>\365\2012\276[/\026>\345\366\377\275mI\316=e\251:\275\256^\265\275\267\326\205=\234\236\210=\"\367\207=\033?\017\275\217\272@=y,\345\274\300\237\240=\210\263\236\276\247\273\374=\203RA\276\377I\031\276\303\242\017\276\363\026\313=\364D\006\275^\3232>\331\333\252=\017=\220\276\344\217\013\276\3013v<\030\t\330\276\262t\032\276X[.\275\362F\r\275n$\001\276)\007\027=\220\336\201\276,\310\344<W\211\">V\317\273\275\376\355\332\275p\305\023=\277\314\371\275\351k4\275\220\356\244\274\322p\266\275\t\221p\275\261I\030\275\360\\\240\275HU}\275\355\271 \275\000\272$>\347\003\004\276\255L\377=9\266s\275\243bV>\255E\365=\007\317\016>\311\274\267\2761\0369\274\315\207\033=\224\346\327=\213N\205=\370&\214\276\350\037\364=\347u\017>\312v\271=\276\203\276=\2075\247\275\033n>=>{\366\2739\360\322=_p\213=J\303\346=\260$\233\276\275\301~\275\217\375\265=\343\272\227\274\364\3459> \246&\275\035Bs\276]\315\313\275S\3649\276w(\017>\352\200l=@\026\024\276\321g\025\275\327\315\210\275<\016\352\275\223\252\302=\231/\221\274\235\300\234=\215\006R\276)\024^=\262\006\211<S\221q\275}1\252=sj\026\275\327w\r\274\274ib>u\355w\274M\372C\276\375\361B=\204\004\344=a\374(>\'\260(=\315e\022=\216,\220\275;mO\276\361Z)=\373\247\311\275^d\243=\203,2>3XC\276\260\244\304=\231#9>k\234r\275\231\205\247=W\366e\275\326,\344=\323\227\304\274\247y\232=3\'\200>\007\263:>\307\n\274\275\252M}\275\352\214G\276eAt=+F\217\275\370\020\034\274\001\274_<\326\367K\275(\n\365=\316\325\245\275\004;\224=\264\305J=\365]7>\334DG\276\235\316\327=m\344r\276\205\215\036=8\357k;\204\224\235\275)\232\022>K\343\242\275\361A5\274&H\371\275\331\274\263\273h\355l\276s\021\225=u\004\332\275q\300E\275^\222=\276\273J_<\276\335\255=\260`<>\003\243\206=\'\265F>D\017\212</\263\006\276v\237g>4\205\324=\265\325\246\274\200\350\305<X/\340\275\216\275\352;\274\2711>1\213\240\276\314\301\005>E\014T\276\017\353\203>\016q_\276\2349\241=\316V\030=\336\247\315\275J\355\237\275\332P\006;\314Ci\275\013\027\360<\266[\251=X\3571\275\tC\030>\201\017\025\274\177\\\204\275\233\310\221<\330\212\314<ng\341\275\024d\263\275JPr\275C+\030\275\307c2\276\211gF>\254\014K\276\242\2464>\t\337#\276\332\014C=\361\t8>\315ad\276\371y\'=\334\271\266=\343s\263>Z9,>\261\247\316\275h\347f\275\307\nq:\023\274<>\016\3111=(s\246\275\337\251\327<\336\217f>>\022\021\274\275\360\277\271p\032/\276\302\321m\275\314\342\270\275\001\023D\276\240H\215;\335\004I\276\206!\211=\013\327%=\204\007\211\275\311\353\324=\201j\207>\033s\020=K\216\020\276\256{\233<\211`\260<\037\371\034\276!S\253\275gk\025\276Y\251\222>I\240\373\275\300j\013\272\005\037:>\266y\010>\240\006`=\272\022\006\276\202\300\314=\341\325\260\274\320\213\310\275\306\240\026>\235\262:\276xo!>\252r\347\275Hp\362=\272`\224\275x\353\346<\313q\310=\337\200\245\275X\303\210=\216KL\276\263\031j<\016b4\275ae\237\275\255+\357\275\'\205\317\275\353I\212\275\370\017\327\274_sH\275I\314\007=\303\252\235=i\224\257>_S\214\274\2041>\275\375\224A\276\302\326\325\274\313\024\221\273Q\337f\274d\214\217\276\223\3163\276\214K\033\275\212\311\307<X\253\247=No\363\275\001=\226=\370E\213>e@\230=K\203\033>\272\333\251\275}\024\034\276\370Rd=\220Ct\276\\\242\037>\245m\220\275\360\025\213=\264x\204\275\275\343\215\275?_T>\2167f\275\352\256\001\276\216\241\317\275Y\016\271=\226O\321<\327Tb>\335\031(\276\022\304\246\275\035\005\211=k~\202=\375\212\273\275\243\024\220\275r\267\031>\373\257\300=\372# <\324I\314=\252\\\234=!)\220<\000a\216\276\230d\216\275\210\250\203>z\246\273=\373\315\342\275\0319n\274\243B\211\276\013\355\325=\003\230\213<.)\270=\200\037\226\276&R\033\276\206\225\022\274+;1\275S[\303<\316X-\274|t\216\276\217\205[=\264]\316\275\017\244\016>\361C\013\276\356\337\204>k\332\002\276\210\206\315=*\221i=\230m\227=l\272\032>\014\250\265<~\250\265=4\263\006=\272\245\252\275\374\341\332<\353\023G\276\026\026o<\317o\274\275\355%\355=\022\236\032\276y\235\336=\201\240h>@4a\275\231\340\347\275\250\303\226\275\001\252\014>[\3756\274\217\334\353\274\251\343U\274\026\326:<\2377\216=\375%[<\205\2611\276J\2659=\300\343\327\275\300\370\300\275\377d\243=\354e\201\275\205\3530\276\227\023\020\276\227\307y=\234\177L\274\013E\327=\033>,\276\320\366\263=\363\260\326=\013\351\217=\"\000\240<\213\250\177\275\273\350\217>x\213\204=\354\036\357=\316\365\370=\353m\016>8\027K<\215Y\t\276a\366/\276l\036\364\273\"2A>\274#T\274\321\344M=a\355\227\275`\253\306\273\235\272\214\274\245\275\020\276\031\345\243\276\023\312>\275\307\017q\275\314\032\317=7\315\327\275\224\237d\275\316\351\025\276\020n\256\276\203h\324\275\306\207\336=Q\360\236=\364\221\034=}\026U\276\244\214\247\275\327\332C>A\303\265\274\336\222R>\251O\333=.\240\340=VP\327=M\025\220>\354\224 >\264\347\017>\302\226\354\275\316.i\276\351v\363\275\337:|=~8K>\007\215\322\275\314\350R\275Lr\224\275\000\363\n>\323\200\320\276j\320F>J6F\276\2505\277=1\263/\275\252\267Z>\354\322,=5\204\271=\345\016\337=U\254\337=\325\021B\276\031w\272\275p<\242\27530\371\274s\2606=\256t\326\275\225\224k\276\351\377\204\275Q\256\370=\031\030\311\274O\244\370\272ASx\274\206\255H=l*\036\274@\206\232\276\003\327\270\275\356f?=(a\000\276<\341\343\275?\3344\275.ik\2751O\221\275\201\275\325=B\346\t>/z\023\276o\312%\275u\276\000=\325\037\373\275\307,\020\276\313\017\354=&<\323=\230\311\213<\037L\353\275\340\237+>.\312h\275\203\0263\275\342\006\372=8h\007>\233\311\300=\201G\332\275\204\300J\275\216x\244\274\313\331\021\276\202=\355\273\005\026e\276D\017V\276\n\357S<\271\n\333<\265\317\272=\325\315\356=hJu=N\355\000=t\013\320\275mi\316\276x\250*\276&\200\202=\343\tT>\223\243\024\275\330\022L\275A\257\300>x\241~\275\350\313D\276\232w\014\276\306N\\=\351k\037>v\351\347=t\013\307=\244\273\272<\255>+<G\036\240\274\363\363\324=:\343\325<\355\t\245=\245xL>k\010\230=k\217\252\275\034e4\274\346S\330=\"\344\n\276\006\364\342=\344~\243\275T\335\204\276\303\244\342\275\273\204\275=AL\262<\233\030u>\230\225)\275\'\020\321=\032[\356=\326,\303=F%5\274\nk\211<\330\260\347\274b1\244\2752V\003\275\r\2246=$\023\263\275\222J\002=\215\005\026>\312\306\345\275\307\300\231>\263~\200\275\332ma=q\337\231\275\3215T\276\365\266\002\276_D)>\257s*=\251\311v=\037\221h\275(\341&\274\031\256\352=\032/\340=i\373|=\037\026\226\274\037F\r\276\264_\315<e\243U>\2629\014\276$\022\277<$W\200>]_\230=z.\214>\361\231\203=\246\220j<\274$\335\275d\356R=\305\3250=\255Xq=\337\"\024=\231\233+>\016\320\372\274\244\033\022<\377P\357=\211U\241\276\010O\221\274|!\200\276\253\206->\035\252\253<\35240\275\263\303\364\275\366\351\323=\nb\213<\246\371X\274\227\377\014>\257a\372\275n<\201\274q\272\334\275\030\360J=#1<>\255\r\364\275\215\267\246\275oG\257\276\027Zo\275\305|\275\273\221\202\352\274^y\277\275\274\343\267=\244>3<K\326\014\276r\233i\276:C\236=Q\014\332\275\3179\325\275\007\020\027\276Lo\211=\255\304\270\276\264\203\200\275\003\014\240<}V\256\275\214\304\266\2743\213e\276\330\024\325\275\320t$>d\325~\275\010uX\274\322\221E>\023\036\353=8\343\367\273`3\277<\333\330\367=\034H\270\275\320}:>\3237|>\022\220\034\275\335\214\007\275i\245\341\274\232\230\213\2762\205\352=\003F\260\274f\326\223=o`U>\021\350\231\276Q\315\354\275\2510f=b\230\014\2750\240\201<e\235l=\2254\231;,\322\216>s\335\003\274\"p\350=\236T\314=\273\306\241\275I)\035\275\013(\267=\203\027\337\274>-%\276t\241s=^\326\231=\236:\020>\021\361\211\275\014s*;\367G2\276\202|\204\275\243\221\221\275\"<\337\275\340\211\326=\265\217\201\274;\244.=);\331\275&\320i\276\003\023:>&9c\276\272\225]>\337\362\007\275\303\300g:\356\322\320=\225\340G\276\331y1\2748\355\340<\315\324\317\273\257\336.\2767\234\341\274\027\224\243\275\205\316y9\222x\'\275\005\357\027\276Eh\200>\371NU>\353\2052\275\245d\261>N\265\226=YB\214>!\376\263\273,\033\214\276\3524\350<#\364\204;\242(\236<\271\252\251\274}la<1%\014>!Q\033>W\306\014>\370(\276=\016\303J>U>\262\275\344\203\205\274\204\221\216=\326\206\250\275\254\241\"\276\217\003*<\335H\247=\244\022H\275}8\r>\237%8>\35407\275\374\221Z=\207>L=\304!\021>\322\360\251=D\352;\275\347\322\244\275\272~\264=\333\243\330\274\370H\251<&\265\220;\257*\240;\njb\274xs[>\2136\331\274e\232\027\275\206\205u\276\244@$>\323\027\367=\254\353\204=\306\327\300\275\035\032K<\340\353\014>xu\007\275\033Xc=\317\037\215>\310\017\372<\2749\247\275A\236\203\273l\210\245\275\240\245\352=\035\021S\276y6U>\3032\363\274\303~\230<\020O<=T\207\356=m\365e\273H&N=\263\232\033>\025Ig=\211\351\234>\205K\332=-\036Z\276\025\010O>=`\226=\2344\t\276\3452p\276R\350\260\275\260N:\276\360\301`\276\313\367\236<|\207\206\275A\330$\276c\361\276<E\331\203>v\345\361\274F\345\331<\315\232\232=\214\017\003>rG\001\276;\225\264\275\r\0345>\343C\303=\034b\210=S.R>\224]\361=\217{>=d\342\374\274\024\224N\274l\247\216=1\214h\275}=H\275\201B\326=i\303\252\274\374\335\366\275\276\356F\275p\3069>,|K\275u\0071=\210~\371=\374}\016\275\3530\363=\330\250\207\276\263j]\276\0053\335=\332_\345\275\202\n\315\274O}\203\275oM\326\275\353\'{=l\016J>b4\223\276\353\271\303=O\257W\276\362\376\363=\003\3744>\232\353~\274\300\214\261\274\321r\003\276\014\305\202\274\306\216\302=\206x\202=\016{\357:\331e\310\274\243\336\226=k\226M\275*\312;\274gl\305\274\327L\206=\224\033\205>{Qg>\213\257\\\274\306\223<>:8\000\276\236\340\000=\241)\n=\352=_=\246\277\217\274\354\330\000\2750\t\014\276H\023\220>\004\0078\275c\2018\276p\231\203=\254{z>\001\262\033\275\256\032j\274\243c\262= L|\274\361\325\307=\362\357%\276\035\3508\275\313\005\211>J\026\227\275\2206\374=\326\331u\274\034\353V= \265\376<uHq\275\342\324U<P/\374\275<\333;\276\016\245\254<\033\334\226\276H%\016\276p\023\010\275\231\212w\276\034\021\020\276\367\251\352\275\025,\'\275\337\036\311=l4\014\274\036\243\225\276E\201q\276f{(=\343\312\004>E\006\260=\363\215\243\275\267\n\000=7\214\215\275O\344\006=\211\326\222\276\265b\326\275/\364H>-\013\370=m\027$\276X\270\240=I\312\032>\222;,\276\240o1\276c\337\257;\236\257U>\307!$\276\251\372\340\275v\0265\275A*\002>G6\306=&\203\177\275s\221\262=z\336\320<l\024\001\275o#7\275\252|\303\275\271\032\244\275\003\220b\274\210x\010\276\301\217\331=%\212\364\274\312V?>\241\360\371\275Ey\017\276\232\256O<\300j<\276\226i\036>\357\373\004=\257j\034\276\363?p=j\323\243\276\323\364D\275\310a$\275\242\214\300=\033\n\310\274\332\371\004\272\262\266\363\275\232\023\r\276\227\226\032=\270H=>~K\217\274\0179\t\276\304\257V>/i\335<\030\335\215=\205\323.=\370\004\237\2758ra>\251\363u\275\010\310\242\274LI_;\265\2605>r\377u\275\240\332\013\276.\234\233=\007\364,\275\205I\205\276\264\220\311<\356\300C>h\3025=\026L\257\275\365\\\305\275\206\236\177\276,D\246\275x\307->`\253\360\2728*\021=\264\236\201\275\375\230D>\314\266%\276bsP>\210\213\212\275kAk=\010\n9>Tt\247<V\n\216=E\203o=9y\221=\204\261\224>\363\221`=(\253\236\275\036Pz>\2718\236;\335\362\037\276\2661\265=T ~=\223\216\363\275R(E\275\357a\003\276\343\030\030\276\321n\244\275\347\333y>\274\210\234;z/\342\274\204\264\220\275\211\314V\274u\2261\275rl\240\275\362BY=\304x\010\276(\231\243=!\005\212\276\254\300\220\274\227P\t\276\006\310\245=\217\032\013<\361\200\225\275\221\375O\275\206\211\247\273!\235\210\274\257\372\274=\027u\313=\375u)\276l\210\234=;\341;>`/\340=a\267:\275\013\326\006>\300:\005>H\217y>\243:F=\237\200\001>T\213\004\274\235\013\240>\0146\255\275\003\342\356\274\224\257\304=L\214\200>l\365\037\275U\365\r\276\360\354t\276s\004\020\276\267<\256\275P\030F=S\264[=\344\026\255\275U\357_\276\250x/\276j\310\323\274_\355D<\"\207\244\276%\251\261<\265i$>\265\246\204\274)\346\217\275\320\224\350\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
